#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
infra relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/private_server/private_server/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/private_server/private_server

To view this run in a browser, visit:
https://app.terraform.io/app/redline/private_server/runs/run-QEnRXcfnftUShuiP

Waiting for the plan to start...

Terraform v1.3.2
on linux_amd64
Initializing plugins and modules...
cloudflare_zone.personal_domain: Refreshing state... [id=cee2af2644f6a3325416173e2d4b44f7]
hcloud_ssh_key.ansible: Refreshing state... [id=8957821]
hcloud_firewall.web_firewall: Refreshing state... [id=603891]
hcloud_server.web: Refreshing state... [id=25709912]
hcloud_firewall_attachment.firewall_assignments: Refreshing state... [id=603891]
hcloud_volume.data: Refreshing state... [id=24743811]
cloudflare_record.a: Refreshing state... [id=394e2bf8790e1e92b4e1fe802421283e]
cloudflare_record.aliases["auth"]: Refreshing state... [id=59a6c353a0138b64113ad34f046c17dc]
cloudflare_record.aliases["photoprism"]: Refreshing state... [id=6c61639959eeaf8d547dd411419bcf9a]
cloudflare_record.aliases["traefik"]: Refreshing state... [id=efbdd0b7c842cec43a43af72a450fcc0]
cloudflare_record.aliases["grocy"]: Refreshing state... [id=1a98a4348007c72461ab6752f2c7f9df]
cloudflare_record.aliases["grafana"]: Refreshing state... [id=a63efd438a1e819f0e4215e4835a0f24]
cloudflare_record.aliases["ldap"]: Refreshing state... [id=416e67a40f89597f342029d943e253ed]
cloudflare_record.aaaa: Refreshing state... [id=734cda661564197e02bf6743c2f179c9]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # cloudflare_record.a must be replaced
-/+ resource "cloudflare_record" "a" {
      ~ created_on      = "2022-11-17T19:50:15.480997Z" -> (known after apply)
      ~ hostname        = "pascal.build" -> (known after apply)
      ~ id              = "394e2bf8790e1e92b4e1fe802421283e" -> (known after apply)
      ~ metadata        = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
          - "source"                 = "primary"
        } -> (known after apply)
      ~ modified_on     = "2022-11-17T19:50:15.480997Z" -> (known after apply)
      ~ name            = "@" -> "pascal.build" # forces replacement
      ~ proxiable       = true -> (known after apply)
      - proxied         = false -> null
      - tags            = [] -> null
        # (5 unchanged attributes hidden)
    }

  # cloudflare_record.aaaa must be replaced
-/+ resource "cloudflare_record" "aaaa" {
      ~ created_on      = "2022-11-17T19:50:15.594876Z" -> (known after apply)
      ~ hostname        = "pascal.build" -> (known after apply)
      ~ id              = "734cda661564197e02bf6743c2f179c9" -> (known after apply)
      ~ metadata        = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
          - "source"                 = "primary"
        } -> (known after apply)
      ~ modified_on     = "2022-11-17T19:50:15.594876Z" -> (known after apply)
      ~ name            = "@" -> "pascal.build" # forces replacement
      ~ proxiable       = true -> (known after apply)
      - proxied         = false -> null
      - tags            = [] -> null
        # (5 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

```

</details>

*Pushed by: @RedlineTriad, Action: `pull_request`*